[{"id":"kie_firefly","source":"KIE","license_level":2,"name":"FIREFLY","mechtype":["Striker"],"description":"<p>Designed primarily as a mining platform, the Firefly is derived in part from the Harrison Armory Sherman and Ghengis chassis, though heavily-modified. However, lack of access to the technologies used to regulate those mechs’ reactors caused the Firefly’s to become relatively unstable under stress. Ever-resourceful, the Rubblefolk that founded KIE decided to “double-down”, allowing the machine to utilize its reactor to melt objects and shield itself. Its effectiveness is only matched by its danger that it poses to its pilot.</p>","mounts":["Flex","Main/Aux"],"stats":{"size":1,"structure":4,"stress":4,"armor":"2","hp":10,"evasion":"7","edef":"7","heatcap":"4","repcap":"5","sensor_range":"8","tech_attack":"-1","save":"10","speed":"3","sp":6},"traits":[{"name":"FEED THE FORGE","use":"","description":"<p>Burn or failing to clear Burn cannot reduce the Firefly’s HP below 1.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"PLAYING WITH FIRE","use":"","description":"<p>When the Firefly succeeds on an Engineering Check to clear Burn, it may opt to keep the Burn but not take damage.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"MOLTEN VEINS","use":"","description":"<p>When it melts down or self-destructs, the Firefly deals Burn instead of Explosive Damage.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"TYPE-43 FUSION FURNACE","active_name":"Spread the Flames","active_effect":"<p>The Firefly selects hostile characters of its choice within Sensor Range and Line of Sight. These characters must succeed on an Engineering Save or take Burn equal to the Firefly’s current Burn on a failure. On a success, they take half of the Firefly’s current Burn.<br><br>For the rest of the Scene, after its turn ends, but before it makes a check to clear burn, the Firefly gains Overshield equal to the amount of Burn it currently has. This lasts until the start of its next turn, or until depleted.</p><p>This ability is <strong>Efficient</strong> and will refund 1 Core Power at the end of any scene in which this ability was used.</p>","activation":"Full","description":"<p><em>The Type-43 Fusion Furnace is built off prototypes of “hot fusion” reactors used by the Rubblefolk early in their history, along with Harrison Armory’s own reactor technologies. While they currently have switched to geothermal power, the output of the Fusion Furnace is extremely high; perhaps a bit too high for even its mech to handle.</em></p>","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"","passive_effect":"","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"https://cdn.discordapp.com/attachments/984628782109425664/1005213477608099991/KIE_FireflyFinalNoBG.png","y_pos":"11"},{"id":"kie_scarab","source":"KIE","license_level":2,"name":"SCARAB","mechtype":["Defender"],"description":"<p>The first design made by the Rubblefolk following their contact with the wider galaxy, the SCARAB is a defender first and foremost. Primarily meant to protect mining teams from debris and local wildlife, the Scarab quickly replaced its predecessor, the “Rubbleshield”.</p>","mounts":["Flex"],"stats":{"size":2,"structure":4,"stress":4,"armor":0,"hp":"8","evasion":"9","edef":"8","heatcap":"6","repcap":"5","sensor_range":10,"tech_attack":0,"save":"10","speed":4,"sp":"7"},"traits":[{"name":"Guardian","use":"","description":"<p>Adjacent allied characters can use the Scarab for hard cover.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Defensive Elytra","use":"","description":"<p>Adjacent allied characters can use the Scarab's SHIELD systems as if they had the EUSOCIAL tag.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Slow","use":"","description":"<p>The Scarab has +1 DIFFICULTY on AGILITY Checks and Saves.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"“Bulwark” PsuedoCarapace","active_name":"Hive Defender: Overcharged","active_effect":"<p>An Ally within HiveMind range gains Overshield equal to 6 + GRIT. This lasts until depleted, or until the end of the Scene. <br><br>Overshield generated in this manner stacks, and does not replace existing Overshield, but a character cannot have more Overshield than its maximum HP.</p><p>This action is <strong>Efficient</strong>, and refunds 1 Core Power at the end of any scene in which it’s used.</p>","activation":"Full","description":"<p><em>The Bulwark PsuedoCarapace utilizes a series of nanite colonies and onboard fabricators to deploy a fluid covering of ablative material.</em></p>","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"Hive Defender","passive_effect":"<p>Whenever one of the Scarab's SHIELD systems is used, the Scarab gains 4 Overshield. If an ally activated it, they also gain this Overshield</p><p>Overshield generated in this manner stacks, and does not replace existing Overshield, but a character cannot have more Overshield than its maximum HP.</p>","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"https://cdn.discordapp.com/attachments/984628782109425664/1005213478669262918/KIE_ScarabFinalNoBG.png","y_pos":"36"},{"id":"kie_weevil","source":"KIE","license_level":2,"name":"WEEVIL","mechtype":["Support"],"description":"<p>The KIE Weevil performs a valuable role in both civilian and military matters: on-demand salvage and scrapping. Designed around a “nest” of nanites and drones, the Weevil is capable of recycling raw and manufactured materials at high efficiency. On a battlefield, it can act as a depository of spare parts, and is capable of flash-fabricating replacements for equipment if supply chains are not available, though it has to dedicate its systems to that task, a dangerous proposition on the battlefield.</p>","mounts":["Main"],"stats":{"size":0.5,"structure":4,"stress":4,"armor":"1","hp":"6","evasion":"12","edef":"12","heatcap":"5","repcap":"8","sensor_range":10,"tech_attack":0,"save":"11","speed":"5","sp":"8"},"traits":[{"name":"What's Yours Is Mine","use":"","description":"<p>1/round, when a hostile character takes Structure Damage or is Destroyed, the Weevil may use a special Reaction to gain 1 Repair. This reaction does not count against the normal amount of Reactions the Weevil may make per turn. These additional Repairs can exceed its Repair Capacity and last until used or until a Full Repair.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"What's Mine Is Yours","use":"","description":"<p>During Rests, allied characters may use the Weevil’s repair capacity as if it was their own.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Whatever Works, Works","use":"","description":"<p>The Weevil may expend 2 Repairs instead of a charge when activating a Limited System.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"“AMBROSIA” Field Recycler Systems","active_name":"Cultivate AMBROSIA","active_effect":"<p>The Weevil selects one wreck within Line of Sight and Sensor Range, to then use 1 Repair to infest the wreck with AMBROSIA nanites.&nbsp;</p><p><br></p><p>At the end of the scene, you can collect the Ambrosia to grant one of the following bonuses to yourself or an allied character:</p><p><br></p><p>- <strong>Rubblesteel Chitin: </strong>The target’s maximum HP increases by 2 and their armor increases by 1 (this can increase their armor past the limit of 4).<br>- <strong>Ethereal Elytra: </strong>The target becomes immune to the <strong>Slowed</strong> condition.</p><p>- <strong>Hive-Insight Drive: </strong>The target’s E-Defense increases by 3, and the final attack roll on their tech attacks cannot suffer from Difficulty.</p><p>- <strong>Breathing Reactor:</strong> The target can use a protocol to clear 2 heat and all Burn.</p><p><br>This action is <strong>Efficient</strong>, and refunds 1 Core Power at the end of any scene in which it’s used.</p><p>A character can only benefit from one instance of each effect, and they last until they perform a Full Repair</p>","activation":"Full","description":"<p><em>Designed by the Rubblefolk early in their history, AMBROSIA nanite colonies were vital in extending the limited supplies they possessed. By breaking down matter into its component parts, they could then reassemble it into something else. The Weevil utilizes these colonies to provide unparalleled flexibility on long-deployment missions.</em></p>","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"","passive_effect":"","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"https://cdn.discordapp.com/attachments/984628782109425664/1005213479055143054/KIE_WeevilFinalNoBG.png","y_pos":"19"},{"id":"kie_hercules","source":"KIE","license_level":2,"name":"HERCULES","mechtype":["Artillery"],"description":"<p>The Hercules is, like most other KIE products, adapted from an existing chassis. Based off a combination of massive tunneling rigs downscaled for combat use and the ZBG7 “Quake” model of Harrison Armory’s “Barbarossa” Frame used by one of the Lancers that helped the defeat the Maker, the Hercules carries a large amount of firepower compared to other KIE offerings.</p>","mounts":["Flex","Main/Aux","Heavy"],"stats":{"size":3,"structure":4,"stress":4,"armor":"1","hp":10,"evasion":6,"edef":"9","heatcap":"5","repcap":"5","sensor_range":"15","tech_attack":0,"save":"10","speed":"2","sp":"7"},"traits":[{"name":"Trajectory Computer","use":"","description":"<p>The Hercules has +1 Accuracy on all attacks with Launcher weapons, unless the weapon already possesses the “Accurate” tag.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Walking Fortress","use":"","description":"<p>Allied Characters may use the Hercules for Hard Cover. Additionally, the Hercule’s weapons gain the “Eusocial” Tag, but any of its weapons used this way draw Line of Sight and Range from the Hercules.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]},{"name":"Quadruped","use":"","description":"<p>The Hercules can’t be pushed, pulled, knocked Prone, or knocked back by smaller characters. Additionally, the Hercules has +1 ACC on Checks and Saves against being knocked Prone or Knocked Back, and any Knockback taken is halved.</p>","actions":[],"bonuses":[],"counters":[],"deployables":[],"synergies":[],"integrated":[],"special_equipment":[]}],"core_system":{"name":"\"Rockbreaker\" Submunitions","active_name":"Seismic Quake Payloads","active_effect":"<p>For the rest of the Scene, Submunition Burst’s 1/round limit is removed, though it may only trigger once each attack. When it activates, all deployables, objects, and terrain of your choice in the radius take an additional 20 AP Explosive damage, and they become Difficult Terrain until the end of the Scene.</p><p>Additionally, when a hostile character is afflicted by Submunition Burst, they must succeed on a HULL Save or become SHREDDED until the end of their next turn.</p>","activation":"Quick","description":"","deactivation":"","use":"","active_actions":[],"active_bonuses":[],"active_synergies":[],"passive_name":"Submunition Burst","passive_effect":"<p>1/round, after a successful attack with a Ranged weapon, the Hercules may elect to create a BURST Zone, centered on the primary target, with a radius of 1, 3, or 5.</p><p>On a hit, this secondary attack deals Explosive damage equal to your GRIT + 2, and does not do Bonus Damage.<br></p><p>The Hercules then takes Heat equal to the BURST radius chosen.</p>","passive_actions":[],"passive_bonuses":[],"passive_synergies":[],"deployables":[],"counters":[],"integrated":[],"special_equipment":[],"tags":[]},"image_url":"https://cdn.discordapp.com/attachments/984628782109425664/1005213478191104143/KIE_HerculesFinalNoBG.png","y_pos":"50"}]